module User::SpotifyHelper

    def countries
			[
				["world", nil ],["日本", "JP"],["アンドラ", "AD"],["アラブ首長国連邦", "AE"],["アルゼンチン", "AR"],
				["オーストリア", "AT"],["オーストラリア", "AU"],["ベルギー", "BE"],["ブルガリア", "BG"],["バーレーン", "BH"],
				["ボリビア多民族国", "BO"],["ブラジル", "BR"],["ベラルーシ", "BY"],["カナダ", "CA"],["スイス", "CH"],["チリ", "CL"],
				["コロンビア", "CO"],["コスタリカ", "CR"],["キプロス", "CY"],["チェコ", "CZ"],["ドイツ", "DE"],["デンマーク", "DK"],
				["ドミニカ共和国", "DO"],["アルジェリア", "DZ"],["エクアドル", "EC"],["エストニア", "EE"],["エジプト", "EG"],["スペイン", "ES"],
				["フィンランド", "FI"],["フランス", "FR"],["イギリス", "GB"],["ギリシャ", "GR"],["グアテマラ", "GT"],["香港", "HK"],
				["ホンジュラス", "HN"],["クロアチア", "HR"],["ハンガリー", "HU"],["インドネシア", "ID"],["アイルランド", "IE"],["イスラエル", "IL"],
				["インディア", "IN"],["アイスランド", "IS"],["イタリア", "IT"],["ヨルダン", "JO"],["クウェート", "KW"],["カザフスタン", "KZ"],
				["レバノン", "LB"],["リヒテンシュタイン", "LI"],["リトアニア", "LT"],["ルクセンブルク", "LU"],["ラトビア", "LV"],["モロッコ", "MA"],
				["モナコ", "MC"],["モンテネグロ", "ME"],["マルタ", "MT"],["メキシコ", "MX"],
				["マレーシア", "MY"],["ニカラグア", "NI"],["オランダ", "NL"],["ノルウェー", "NO"],["ニュージーランド", "NZ"],["オマーン", "OM"],
				["パナマ", "PA"],["ペルー", "PE"],["フィリピン", "PH"],["ポーランド", "PL"],["パレスチナ", "PS"],["ポルトガル", "PT"],
				["パラグアイ", "PY"],["カタール", "QA"],["ルーマニア", "RO"],["ロシア", "RU"],["サウジアラビア	", "SA"],
				["スウェーデン", "SE"],["シンガポール", "SG"],["スロベニア", "SI"],["スロバキア", "SK"],["エルサルバドル", "SV"],["タイ", "TH"],
				["チュニジア", "TN"],["トルコ", "TR"],["台湾", "TW"],["ウクライナ", "UA"],["アメリカ合衆国", "US"],["ウルグアイ", "UY"],
				["ベトナム", "VN"],["南アフリカ共和国", "ZA"]
			]
		end

		def times
			[
				["指定無し","指定無し"],["今日","今日"],["１週間","１週間"],["一ヶ月","一ヶ月"],
			]
		end
		
		
end